/* ------------------------------------------------------------------------- */
/*  HOS-H8 秋月版コンパイラ用 オブジェクトパッケージ化ファイル               */
/*                                                                           */
/*                                   Copyright (C) 1998-2002 by Project HOS  */
/* ------------------------------------------------------------------------- */


/* すべてのＣ言語プログラムを１つのオブジェクトファイルにする */
#include "system.c"
#include "task.c"
#include "task_que.c"
#include "semaphor.c"
#include "eventflg.c"
#include "mailbox.c"
#include "fixmem.c"
#include "timer.c"
#include "interrup.c"


/* ------------------------------------------------------------------------- */
/*  Copyright (C) 1998-2002 by Project HOS                                   */
/* ------------------------------------------------------------------------- */
